# Merge Function
The merge function in pandas is used to combine two or more DataFrames based on common columns

In [1]:

import pandas as pd

# Sample data for the left DataFrame
data_left = {'ID': [1, 2, 3, 4],
             'Name': ['Alice', 'Bob', 'Charlie', 'David'],
             'Age': [25, 30, 28, 22]}

# Sample data for the right DataFrame
data_right = {'ID': [3, 4, 5, 6],
              'Salary': [50000, 60000, 75000, 80000],
              'Location': ['NY', 'CA', 'TX', 'WA']}

left_df = pd.DataFrame(data_left)
right_df = pd.DataFrame(data_right)

In [2]:
left_df

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   28
3   4    David   22

In [3]:
right_df

   ID  Salary Location
0   3   50000       NY
1   4   60000       CA
2   5   75000       TX
3   6   80000       WA

# Inner Merge
An inner merge returns only the rows with matching keys in both DataFrames.

In [4]:
inner = pd.merge(left_df,right_df,on='ID',how='inner')

In [5]:
inner

   ID     Name  Age  Salary Location
0   3  Charlie   28   50000       NY
1   4    David   22   60000       CA

# Left Merge
A left merge returns all rows from the left DataFrame and the matching rows from the right DataFrame.

In [6]:
left = pd.merge(left_df,right_df,on='ID',how='left')

In [7]:
left

   ID     Name  Age   Salary Location
0   1    Alice   25      NaN      NaN
1   2      Bob   30      NaN      NaN
2   3  Charlie   28  50000.0       NY
3   4    David   22  60000.0       CA

# Right Merge
A right merge returns all rows from the right DataFrame and the matching rows from the left DataFrame.

In [8]:
right = pd.merge(left_df,right_df,on='ID',how='right')

In [9]:
right

   ID     Name   Age  Salary Location
0   3  Charlie  28.0   50000       NY
1   4    David  22.0   60000       CA
2   5      NaN   NaN   75000       TX
3   6      NaN   NaN   80000       WA

# Outer Merge
An outer merge returns all rows from both DataFrames, filling in missing values with NaN where data is not available.

In [10]:
outer = pd.merge(left_df,right_df,on='ID',how='outer')

In [11]:
outer

   ID     Name   Age   Salary Location
0   1    Alice  25.0      NaN      NaN
1   2      Bob  30.0      NaN      NaN
2   3  Charlie  28.0  50000.0       NY
3   4    David  22.0  60000.0       CA
4   5      NaN   NaN  75000.0       TX
5   6      NaN   NaN  80000.0       WA